app/controllers/books_controller.rb

def create
	@book = Book.new(params[:book])
	@owner = User.find_by_id(@book.user_id)
	@owner.books << @book
---
INSERT INTO "books" ("author", "created_at", "image", "isbn", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

def show
	@books = Book.all
	@owner = Book.find_by_id(params[:id]).user
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]